cask_args appdir: '/Applications'

# Taps
tap 'homebrew/bundle'
tap 'caskroom/fonts'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install more recent versions of some macOS tools
brew 'grep'

# Install XQuartz
cask 'xquartz'

# Install Binaries
brew 'ack'
brew 'ag'
brew 'chruby'
brew 'fzf'
brew 'grc'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'mas'
brew 'node'
brew 'openssl'
brew 'python2'
brew 'python3'
brew 'readline'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'youtube-dl'

# Development
brew 'go'
brew 'yarn'
cask 'sequel-pro'
brew 'postgresql'
brew 'cassandra'

# Apps
cask 'adium'
cask 'aerial'
cask 'caffeine'
cask 'docker'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'insomnia'
cask 'iterm2'
cask 'ngrok'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'telegram'
cask 'tidal'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'flycut'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'
cask 'font-go'
cask 'font-go-mono'
cask 'font-lato'

# Install Mac App Store apps
mas '1Password', id: 443987910
mas 'Unsplash Wallpapers', id: 1284863847
mas 'The Unarchiver', id: 425424353
mas 'Lightshot Screenshot', id: 526298438
mas 'Keynote', id: 409183694
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
